{"config": [{"config": {"border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "trainable": true, "batch_input_shape": [null, 51, 160, 1], "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 24, "subsample": [2, 2], "b_regularizer": null, "name": "convolution2d_1", "bias": true, "W_constraint": null, "activation": "linear", "input_dtype": "float32", "nb_row": 5, "nb_col": 5, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"epsilon": 0.001, "name": "batchnormalization_1", "trainable": true, "momentum": 0.99, "axis": -1, "mode": 1, "beta_regularizer": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 36, "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_2", "bias": true, "W_constraint": null, "activation": "linear", "nb_row": 5, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"epsilon": 0.001, "name": "batchnormalization_2", "trainable": true, "momentum": 0.99, "axis": -1, "mode": 1, "beta_regularizer": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 48, "subsample": [2, 2], "nb_col": 5, "name": "convolution2d_3", "bias": true, "W_constraint": null, "activation": "linear", "nb_row": 5, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"epsilon": 0.001, "name": "batchnormalization_3", "trainable": true, "momentum": 0.99, "axis": -1, "mode": 1, "beta_regularizer": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "W_regularizer": null, "activity_regularizer": null, "trainable": true, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_filter": 64, "subsample": [1, 1], "nb_col": 3, "name": "convolution2d_4", "bias": true, "W_constraint": null, "activation": "linear", "nb_row": 3, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 100, "name": "dense_1", "input_dim": 960, "b_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"epsilon": 0.001, "name": "batchnormalization_4", "trainable": true, "momentum": 0.99, "axis": -1, "mode": 1, "beta_regularizer": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 10, "name": "dense_2", "input_dim": 100, "b_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"epsilon": 0.001, "name": "batchnormalization_5", "trainable": true, "momentum": 0.99, "axis": -1, "mode": 1, "beta_regularizer": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "activity_regularizer": null, "trainable": true, "output_dim": 1, "name": "dense_3", "input_dim": 10, "b_regularizer": null, "W_constraint": null, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}