{"config": [{"config": {"nb_row": 8, "nb_col": 8, "bias": true, "b_regularizer": null, "input_dtype": "float32", "activity_regularizer": null, "subsample": [4, 4], "batch_input_shape": [null, 40, 40, 1], "dim_ordering": "tf", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "name": "convolution2d_1", "activation": "linear", "trainable": true, "nb_filter": 16}, "class_name": "Convolution2D"}, {"config": {"axis": -1, "mode": 1, "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_1", "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "nb_col": 5, "bias": true, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "b_constraint": null, "nb_filter": 32, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"axis": -1, "mode": 1, "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_2", "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "nb_col": 5, "bias": true, "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "border_mode": "same", "activation": "linear", "trainable": true, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"axis": -1, "mode": 1, "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_3", "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"input_dim": 576, "output_dim": 512, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "trainable": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"axis": -1, "mode": 1, "epsilon": 0.001, "beta_regularizer": null, "momentum": 0.99, "trainable": true, "name": "batchnormalization_4", "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"input_dim": 512, "output_dim": 1, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "trainable": true, "name": "dense_2"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}