{"keras_version": "1.2.0", "config": [{"config": {"dim_ordering": "tf", "subsample": [4, 4], "input_dtype": "float32", "b_constraint": null, "nb_filter": 16, "batch_input_shape": [null, 40, 40, 1], "nb_row": 8, "border_mode": "same", "W_constraint": null, "bias": true, "name": "convolution2d_1", "activity_regularizer": null, "nb_col": 8, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"gamma_regularizer": null, "axis": -1, "name": "batchnormalization_1", "momentum": 0.99, "trainable": true, "beta_regularizer": null, "mode": 1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "subsample": [2, 2], "nb_filter": 32, "name": "convolution2d_2", "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "nb_col": 5, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"gamma_regularizer": null, "axis": -1, "name": "batchnormalization_2", "momentum": 0.99, "trainable": true, "beta_regularizer": null, "mode": 1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "subsample": [2, 2], "nb_filter": 64, "name": "convolution2d_3", "nb_row": 5, "W_constraint": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "nb_col": 5, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"gamma_regularizer": null, "axis": -1, "name": "batchnormalization_3", "momentum": 0.99, "trainable": true, "beta_regularizer": null, "mode": 1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "output_dim": 512, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "input_dim": 576, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"gamma_regularizer": null, "axis": -1, "name": "batchnormalization_4", "momentum": 0.99, "trainable": true, "beta_regularizer": null, "mode": 1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_2", "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "input_dim": 512, "b_regularizer": null, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}