{"config": [{"config": {"batch_input_shape": [null, 51, 160, 1], "border_mode": "valid", "dim_ordering": "tf", "nb_filter": 24, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dtype": "float32", "name": "convolution2d_1", "subsample": [2, 2], "b_regularizer": null, "trainable": true, "nb_col": 5, "nb_row": 5, "W_regularizer": null, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_1", "mode": 1, "axis": -1, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "nb_filter": 36, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "name": "convolution2d_2", "subsample": [2, 2], "b_regularizer": null, "trainable": true, "nb_col": 5, "nb_row": 5, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_2", "mode": 1, "axis": -1, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "nb_filter": 48, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "name": "convolution2d_3", "subsample": [2, 2], "b_regularizer": null, "trainable": true, "nb_col": 5, "nb_row": 5, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_3", "mode": 1, "axis": -1, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "nb_filter": 64, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "name": "convolution2d_4", "subsample": [1, 1], "b_regularizer": null, "trainable": true, "nb_col": 3, "nb_row": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "W_constraint": null, "name": "dense_1", "b_regularizer": null, "bias": true, "input_dim": 960, "W_regularizer": null, "trainable": true, "output_dim": 100}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "batchnormalization_4", "mode": 1, "axis": -1, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "W_constraint": null, "name": "dense_2", "b_regularizer": null, "bias": true, "input_dim": 100, "W_regularizer": null, "trainable": true, "output_dim": 10}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "batchnormalization_5", "mode": 1, "axis": -1, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "beta_regularizer": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "activation": "linear", "b_constraint": null, "W_constraint": null, "name": "dense_3", "b_regularizer": null, "bias": true, "input_dim": 10, "W_regularizer": null, "trainable": true, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}