{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 24, "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "trainable": true, "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "name": "convolution2d_1", "bias": true, "input_dtype": "float32", "border_mode": "valid", "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "batch_input_shape": [null, 51, 160, 1]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "name": "batchnormalization_1", "mode": 1, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "trainable": true, "border_mode": "valid", "name": "convolution2d_2", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "name": "batchnormalization_2", "mode": 1, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "nb_row": 5, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5, "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "trainable": true, "border_mode": "valid", "name": "convolution2d_3", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "name": "batchnormalization_3", "mode": 1, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3, "b_regularizer": null, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "bias": true, "trainable": true, "border_mode": "valid", "name": "convolution2d_4", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "output_dim": 100, "activation": "linear", "bias": true, "trainable": true, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "input_dim": 960}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "name": "batchnormalization_4", "mode": 1, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "output_dim": 10, "activation": "linear", "bias": true, "trainable": true, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "input_dim": 100}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "axis": -1, "name": "batchnormalization_5", "mode": 1, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "output_dim": 1, "activation": "linear", "bias": true, "trainable": true, "name": "dense_3", "activity_regularizer": null, "W_regularizer": null, "input_dim": 10}}], "keras_version": "1.2.0"}