{"keras_version": "1.2.0", "config": [{"config": {"nb_filter": 24, "b_regularizer": null, "subsample": [2, 2], "name": "convolution2d_1", "input_dtype": "float32", "batch_input_shape": [null, 51, 160, 1], "W_constraint": null, "activation": "linear", "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "trainable": true, "nb_row": 5, "border_mode": "valid", "activity_regularizer": null, "bias": true, "nb_col": 5, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "mode": 1, "name": "batchnormalization_1", "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"nb_filter": 36, "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_2", "init": "glorot_uniform", "b_constraint": null, "trainable": true, "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "mode": 1, "name": "batchnormalization_2", "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"nb_filter": 48, "b_regularizer": null, "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_3", "init": "glorot_uniform", "b_constraint": null, "trainable": true, "nb_row": 5, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "mode": 1, "name": "batchnormalization_3", "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "convolution2d_4", "init": "glorot_uniform", "b_constraint": null, "trainable": true, "nb_row": 3, "border_mode": "valid", "W_regularizer": null, "bias": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "name": "hidden1", "output_dim": 100, "W_constraint": null, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "input_dim": 960}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"momentum": 0.99, "mode": 1, "name": "batchnormalization_4", "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "name": "hidden2", "output_dim": 10, "W_constraint": null, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "input_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"momentum": 0.99, "mode": 1, "name": "batchnormalization_5", "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "name": "Steering_Angle", "output_dim": 1, "W_constraint": null, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "input_dim": 10}, "class_name": "Dense"}], "class_name": "Sequential"}