{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_filter": 24, "input_dtype": "float32", "dim_ordering": "tf", "border_mode": "valid", "batch_input_shape": [null, 51, 160, 1], "activation": "linear", "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "W_constraint": null, "b_regularizer": null, "bias": true, "trainable": true, "init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "name": "convolution2d_1"}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "axis": -1, "name": "batchnormalization_1", "trainable": true, "gamma_regularizer": null, "mode": 1, "epsilon": 0.001}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_filter": 36, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_2", "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "axis": -1, "name": "batchnormalization_2", "trainable": true, "gamma_regularizer": null, "mode": 1, "epsilon": 0.001}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "nb_filter": 48, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_3", "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "subsample": [2, 2], "bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "axis": -1, "name": "batchnormalization_3", "trainable": true, "gamma_regularizer": null, "mode": 1, "epsilon": 0.001}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "nb_filter": 64, "b_constraint": null, "dim_ordering": "tf", "name": "convolution2d_4", "border_mode": "valid", "activation": "linear", "activity_regularizer": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "nb_col": 3, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 960, "output_dim": 100, "bias": true, "name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "axis": -1, "name": "batchnormalization_4", "trainable": true, "gamma_regularizer": null, "mode": 1, "epsilon": 0.001}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 100, "output_dim": 10, "bias": true, "name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"beta_regularizer": null, "momentum": 0.99, "axis": -1, "name": "batchnormalization_5", "trainable": true, "gamma_regularizer": null, "mode": 1, "epsilon": 0.001}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "input_dim": 10, "output_dim": 1, "bias": true, "name": "dense_3", "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "trainable": true, "activation": "linear"}}], "keras_version": "1.2.0"}