{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_1", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 24, "input_dtype": "float32", "activation": "linear", "batch_input_shape": [null, 51, 160, 1], "trainable": true, "bias": true, "W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "beta_regularizer": null, "name": "batchnormalization_1", "mode": 1, "gamma_regularizer": null, "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_2", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 36, "nb_col": 5, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "beta_regularizer": null, "name": "batchnormalization_2", "mode": 1, "gamma_regularizer": null, "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_3", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "subsample": [2, 2], "nb_filter": 48, "nb_col": 5, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 5, "init": "glorot_uniform"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "beta_regularizer": null, "name": "batchnormalization_3", "mode": 1, "gamma_regularizer": null, "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "name": "convolution2d_4", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "subsample": [1, 1], "nb_filter": 64, "nb_col": 3, "activation": "linear", "trainable": true, "bias": true, "W_constraint": null, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "input_dim": 960, "trainable": true, "bias": true, "name": "dense_1", "output_dim": 100, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "beta_regularizer": null, "name": "batchnormalization_4", "mode": 1, "gamma_regularizer": null, "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "input_dim": 100, "trainable": true, "bias": true, "name": "dense_2", "output_dim": 10, "b_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "trainable": true, "beta_regularizer": null, "name": "batchnormalization_5", "mode": 1, "gamma_regularizer": null, "axis": -1, "momentum": 0.99}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "input_dim": 10, "trainable": true, "bias": true, "name": "dense_3", "output_dim": 1, "b_regularizer": null, "init": "glorot_uniform"}}], "keras_version": "1.2.0"}