{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_1", "border_mode": "valid", "activity_regularizer": null, "input_dtype": "float32", "activation": "linear", "subsample": [2, 2], "nb_filter": 24, "W_constraint": null, "b_regularizer": null, "nb_row": 5, "nb_col": 5, "W_regularizer": null, "batch_input_shape": [null, 51, 160, 1], "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "axis": -1, "trainable": true, "mode": 1, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_2", "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_filter": 36, "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "axis": -1, "trainable": true, "mode": 1, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_3", "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "subsample": [2, 2], "nb_filter": 48, "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "nb_col": 5, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "axis": -1, "trainable": true, "mode": 1, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_4", "border_mode": "valid", "activity_regularizer": null, "activation": "linear", "subsample": [1, 1], "nb_filter": 64, "W_regularizer": null, "b_regularizer": null, "nb_row": 3, "nb_col": 3, "W_constraint": null, "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "name": "dense_1", "activity_regularizer": null, "input_dim": 960, "activation": "linear", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 100, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "axis": -1, "trainable": true, "mode": 1, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "name": "dense_2", "activity_regularizer": null, "input_dim": 100, "activation": "linear", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 10, "b_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_regularizer": null, "name": "batchnormalization_5", "epsilon": 0.001, "axis": -1, "trainable": true, "mode": 1, "gamma_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "name": "dense_3", "activity_regularizer": null, "input_dim": 10, "activation": "linear", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "b_constraint": null}}]}