{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 16, "b_regularizer": null, "activation": "linear", "input_dtype": "float32", "batch_input_shape": [null, 40, 40, 1], "nb_row": 8, "name": "convolution2d_1", "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "border_mode": "same", "bias": true, "subsample": [4, 4], "activity_regularizer": null, "nb_col": 8, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"mode": 1, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 32, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "convolution2d_2", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "nb_row": 5, "activity_regularizer": null, "border_mode": "same", "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 5, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"mode": 1, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "name": "convolution2d_3", "trainable": true, "b_constraint": null, "init": "glorot_uniform", "nb_row": 5, "activity_regularizer": null, "border_mode": "same", "bias": true, "subsample": [2, 2], "dim_ordering": "tf", "nb_col": 5, "W_constraint": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "BatchNormalization", "config": {"mode": 1, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "input_dim": 576, "name": "dense_1", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "output_dim": 512}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "BatchNormalization", "config": {"mode": 1, "axis": -1, "beta_regularizer": null, "gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "momentum": 0.99}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "linear", "input_dim": 512, "name": "dense_2", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "output_dim": 1}}], "keras_version": "1.2.0"}